### Hive Specific Questions:

In [1]:
import pandas as pd

In [2]:
# Create a DataFrame
data = {'id':['1904287', '96391595', '2236067'],
        'name':['Christopher Rodriguez', 'Thomas Stewart', 'John Nelson'],       
        'birthday':['Jan 11, 2003','6/17/1969','08/22/54']}

df = pd.DataFrame(data)
df

         id                   name      birthday
0   1904287  Christopher Rodriguez  Jan 11, 2003
1  96391595         Thomas Stewart     6/17/1969
2   2236067            John Nelson      08/22/54

In [3]:
# Change the format of birthday column
df.birthday = pd.to_datetime(df.birthday).dt.strftime('%m/%d/%y')

In [4]:
df

         id                   name  birthday
0   1904287  Christopher Rodriguez  01/11/03
1  96391595         Thomas Stewart  06/17/69
2   2236067            John Nelson  08/22/54

In [5]:
# Save the solution table in the directory
df.to_csv('solution.csv', sep='\t', index=False)
#df.to_csv('/user/cert/problem1/solution.csv', sep='\t', index=False)